Revit 2026 API

# View3DSaveOrientationAndLock Method

---

Locks the view and saves its orientation

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SaveOrientationAndLock()
```
```vb
Public Sub SaveOrientationAndLock
```
```cpp
public:
void SaveOrientationAndLock()
```
```fsharp
member SaveOrientationAndLock : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Returns true if the view is not a view template. -or- The orientation of the View3D cannot be saved. |

#### Reference

View3D Class

Autodesk.Revit.DB Namespace